tap "github/gh"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/core"

cask "xquartz"

# Ammonite is a cleanroom re-implementation of the Scala REPL
brew "ammonite-repl"
# GNU database manager
brew "gdbm"
# YAML Parser
brew "libyaml"
# Library for command-line editing
brew "readline"
# Command-line interface for SQLite
brew "sqlite"
# General-purpose data compression with high compression ratio
brew "xz"
# Automate deployment, configuration, and upgrading
brew "ansible"
# Java build tool
brew "ant"
# Automatic configure script builder
brew "autoconf"
# Tool for generating GNU Standards-compliant Makefiles
brew "automake"
# Avro command-line tools and utilities
brew "avro-tools"
# Official Amazon AWS command-line interface
brew "awscli"
# Bourne-Again SHell, a UNIX command interpreter
brew "bash"
# Informative, fancy bash prompt for Git users
brew "bash-git-prompt"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# C/C++ and Java libraries for Unicode and globalization
brew "icu4c"
# GNU internationalization (i18n) and localization (l10n) library
brew "gettext"
# Interpreted, interactive, object-oriented programming language
brew "python"
# Bash and Zsh completion for Cargo
brew "cargo-completion"
# Statistics utility to count lines of code
brew "cloc"
# Cross-platform make
brew "cmake"
# Dependency manager for Cocoa projects
brew "cocoapods"
# Color-highlighted diff(1) output
brew "colordiff"
# Tool for browsing source code
brew "cscope"
# Reimplementation of ctags(1)
brew "ctags"
# Get a file from an HTTP, HTTPS or FTP server
brew "curl"
# Good-lookin' diffs with diff-highlight and more
brew "diff-so-fancy"
# Load/unload environment variables based on $PWD
brew "direnv"
# Select default apps for documents and URL schemes on macOS
brew "duti"
# Modern replacement for 'ls'
brew "exa"
# Command-line tool to interact with exercism.io
brew "exercism"
# GNU multiple precision arithmetic library
brew "gmp"
# C string library for manipulating Unicode strings
brew "libunistring"
# International domain name library (IDNA2008, Punycode and TR46)
brew "libidn2"
# Play, record, convert, and stream audio and video
brew "ffmpeg"
# Play, record, convert, and stream audio and video
brew "ffmpeg@2.8"
# Platform built on V8 to build network applications
brew "node"
# Command-line JSON processing tool
brew "fx"
# GIF image/animation creator/editor
brew "gifsicle"
# Perl compatible regular expressions library with a new API
brew "pcre2"
# Distributed revision control system
brew "git"
# Small git utilities
brew "git-extras"
# Simple and efficient way to access statistics in git
brew "git-quick-stats"
# C++ mathematics library for graphics software
brew "glm"
# Open source programming language to build simple/reliable/efficient software
brew "go"
# Version Control Visualization Tool
brew "gource"
# Generic library support script
brew "libtool"
# Image processing tools collection
brew "graphicsmagick"
# Graph visualization software from AT&T and Bell Labs
brew "graphviz"
# Multi-platform programming language
brew "haxe"
# User-friendly cURL replacement (command-line HTTP client)
brew "httpie"
# Add GitHub support to git on the command-line
brew "hub"
# Tools and libraries to manipulate images in many formats
brew "imagemagick"
# Calculate various network masks, etc. from a given IP address
brew "ipcalc"
# Regular expressions library
brew "oniguruma"
# Lightweight and flexible command-line JSON processor
brew "jq"
# JSON parser and validator with a CLI
brew "jsonlint"
# Publish-subscribe messaging rethought as a distributed commit log
brew "kafka"
# Tool to move from `docker-compose` to Kubernetes
brew "kompose"
# The lazier way to manage everything docker
brew "lazydocker"
# X.509 and CMS library
brew "libksba"
# Postgres C API library
brew "libpq"
# C library implementing the SSH2 protocol
brew "libssh2"
# C XSLT library for GNOME
brew "libxslt"
# Clone of ls with colorful output, file type icons, and more
brew "lsd"
# Mac App Store command-line interface
brew "mas"
# Show markdown documents on text terminals
brew "mdcat"
# Intercept, modify, replay, save HTTP/S traffic
brew "mitmproxy"
# UNIX movie player
brew "mplayer"
# 'traceroute' and 'ping' in a single tool
brew "mtr"
# Netwide Assembler (NASM) is an 80x86 assembler
brew "nasm"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# Manage multiple Node.js versions
brew "nvm"
# Tool for creating identical machine images for multiple platforms
brew "packer"
# Shell command parallelization utility
brew "parallel"
# CLI for Postgres with auto-completion and syntax highlighting
brew "pgcli"
# Parallel gzip
brew "pigz"
# Manage compile and link flags for libraries
brew "pkg-config"
# Object-relational database system
brew "postgresql@9.6"
# Parse HTML at the command-line
brew "pup"
# Password generator
brew "pwgen"
# Interpreted, interactive, object-oriented programming language
brew "python@2"
# Install various Ruby versions and implementations
brew "ruby-build"
# Ruby version manager
brew "rbenv"
# Adds basic gemset support to rbenv
brew "rbenv-gemset"
# Alternative to backtracking PCRE-style regular expression engines
brew "re2"
# Convert character set (charsets)
brew "recode"
# Build tool for Scala projects
brew "sbt@0.13"
# JVM-based programming language
brew "scala@2.11"
# Static analysis and lint tool, for (ba)sh scripts
brew "shellcheck"
# Nodejs-based tool for optimizing SVG vector graphics files
brew "svgo"
# Tool to build, change, and version infrastructure
brew "terraform"
# Ansible provisioner for Terraform
brew "terraform-provisioner-ansible"
# Export existing AWS resources to Terraform style (tf, tfstate)
brew "terraforming"
# Multi-platform code-search similar to ack and ag
brew "the_platinum_searcher"
# Granddaddy of HTML tools, with support for modern standards
brew "tidy-html5"
# ODBC 3 connectivity for UNIX
brew "unixodbc"
# Extract, view, and test RAR archives
brew "unrar"
# Extraction utility for .zip compressed archives
brew "unzip"
# Bash completion for Vagrant
brew "vagrant-completion"
# Executes a program periodically, showing output fullscreen
brew "watch"
# Watch files and take action when they change
brew "watchman"
# Internet file retriever
brew "wget"
# JavaScript package manager
brew "yarn"
# Process YAML documents from the CLI
brew "yq"
# Tracks most-used directories to make cd smarter
brew "z"
# General-purpose lossless data-compression library
brew "zlib"
# GitHub CLI
brew "github/gh/gh"

cask "docker"
cask "font-bitstreamverasansmono-nerd-font-mono"
cask "font-cascadia"
cask "font-fira-code"
cask "font-jetbrains-mono"
cask "font-liberation-sans"
cask "java8"
cask "qlcolorcode"
cask "quicklook-json"
cask "vagrant"
cask "visual-studio-code"

mas "Airmail", id: 918858936
mas "Fantastical", id: 975937182
mas "GIPHY CAPTURE", id: 668208984
mas "Keynote", id: 409183694
mas "Magnet", id: 441258766
mas "Mouseposé", id: 405904955
mas "Pixelmator", id: 407963104
mas "Slack", id: 803453959
mas "Xcode", id: 497799835
