cask_args appdir: "/Applications"
tap "caskroom/cask"
tap "caskroom/fonts"
tap "ggpeti/rmrec"
tap "homebrew/bundle"
tap "homebrew/core"
tap "homebrew/services"
brew "autoconf"
brew "libffi"
brew "libtool"
brew "pkg-config"
brew "readline"
brew "autogen"
brew "automake"
brew "awscli"
brew "awslogs"
brew "bash-completion"
brew "bash-git-prompt"
brew "cloc"
brew "colordiff"
brew "cscope"
brew "ctags"
brew "docker-completion"
brew "dockutil"
brew "duti"
brew "exa"
brew "figlet"
brew "flake8"
brew "gdbm"
brew "gettext"
brew "git"
brew "git-extras"
brew "git-quick-stats"
brew "go"
brew "hadolint"
brew "heroku"
brew "openssl"
brew "sqlite"
brew "xz"
brew "httpie"
brew "oniguruma"
brew "jq"
brew "jsonlint"
brew "kubernetes-cli"
brew "libav"
brew "libyaml"
brew "lua"
brew "luajit"
brew "macvim", args: ["with-lua", "with-luajit", "with-override-system-vim", "with-python3", "without-python"]
brew "mas"
brew "nasm"
brew "node"
brew "nvm"
brew "pngcrush"
brew "pup"
brew "python3"
brew "ruby-build"
brew "rbenv"
brew "rbenv-binstubs"
brew "recode"
brew "rust"
brew "svgo"
brew "switchaudio-osx"
brew "the_platinum_searcher"
brew "tidy-html5"
brew "tree"
brew "unrar"
brew "wabt"
brew "watch"
brew "wget"
brew "wordplay"
brew "yarn"
brew "yasm"
brew "youtube-dl"
brew "z"
cask "font-fira-code"
cask "google-chrome"
cask "otx"
cask "skyfonts"
cask "sourcetree"
cask "wireshark"
mas "Airmail 3", id: 918858936
mas "Bear", id: 1091189122
mas "CCMenu", id: 603117688
mas "Fantastical 2", id: 975937182
mas "GarageBand", id: 682658836
mas "iMovie", id: 408981434
mas "Keynote", id: 409183694
mas "Logic Pro X", id: 634148309
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "Pixelmator", id: 407963104
mas "Slack", id: 803453959
mas "SoundCloud", id: 412754595
mas "Things3", id: 904280696
mas "Tweetbot", id: 557168941
mas "Xcode", id: 497799835
